Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GA202.h
#define _U1STA_URXDA_POSITION                    0x00000000
#define _U1STA_URXDA_MASK                        0x00000001
#define _U1STA_URXDA_LENGTH                      0x00000001

#define _U1STA_OERR_POSITION                     0x00000001
#define _U1STA_OERR_MASK                         0x00000002
#define _U1STA_OERR_LENGTH                       0x00000001

#define _U1STA_FERR_POSITION                     0x00000002
#define _U1STA_FERR_MASK                         0x00000004
#define _U1STA_FERR_LENGTH                       0x00000001

#define _U1STA_PERR_POSITION                     0x00000003
#define _U1STA_PERR_MASK                         0x00000008
#define _U1STA_PERR_LENGTH                       0x00000001

#define _U1STA_RIDLE_POSITION                    0x00000004
#define _U1STA_RIDLE_MASK                        0x00000010
#define _U1STA_RIDLE_LENGTH                      0x00000001

#define _U1STA_ADDEN_POSITION                    0x00000005
#define _U1STA_ADDEN_MASK                        0x00000020
#define _U1STA_ADDEN_LENGTH                      0x00000001

#define _U1STA_URXISEL_POSITION                  0x00000006
#define _U1STA_URXISEL_MASK                      0x000000C0
#define _U1STA_URXISEL_LENGTH                    0x00000002

#define _U1STA_TRMT_POSITION                     0x00000008
#define _U1STA_TRMT_MASK                         0x00000100
#define _U1STA_TRMT_LENGTH                       0x00000001

#define _U1STA_UTXBF_POSITION                    0x00000009
#define _U1STA_UTXBF_MASK                        0x00000200
#define _U1STA_UTXBF_LENGTH                      0x00000001

#define _U1STA_UTXEN_POSITION                    0x0000000A
#define _U1STA_UTXEN_MASK                        0x00000400
#define _U1STA_UTXEN_LENGTH                      0x00000001

#define _U1STA_UTXBRK_POSITION                   0x0000000B
#define _U1STA_UTXBRK_MASK                       0x00000800
#define _U1STA_UTXBRK_LENGTH                     0x00000001

#define _U1STA_URXEN_POSITION                    0x0000000C
#define _U1STA_URXEN_MASK                        0x00001000
#define _U1STA_URXEN_LENGTH                      0x00000001

#define _U1STA_UTXISEL0_POSITION                 0x0000000D
#define _U1STA_UTXISEL0_MASK                     0x00002000
#define _U1STA_UTXISEL0_LENGTH                   0x00000001

#define _U1STA_UTXINV_POSITION                   0x0000000E
#define _U1STA_UTXINV_MASK                       0x00004000
#define _U1STA_UTXINV_LENGTH                     0x00000001

#define _U1STA_UTXISEL1_POSITION                 0x0000000F
#define _U1STA_UTXISEL1_MASK                     0x00008000
#define _U1STA_UTXISEL1_LENGTH                   0x00000001

#define _U1STA_URXISEL0_POSITION                 0x00000006
#define _U1STA_URXISEL0_MASK                     0x00000040
#define _U1STA_URXISEL0_LENGTH                   0x00000001

#define _U1STA_URXISEL1_POSITION                 0x00000007
#define _U1STA_URXISEL1_MASK                     0x00000080
#define _U1STA_URXISEL1_LENGTH                   0x00000001

#define _U1TXREG_LAST_POSITION                   0x0000000F
#define _U1TXREG_LAST_MASK                       0x00008000
#define _U1TXREG_LAST_LENGTH                     0x00000001

#define _U1ADMD_ADMADDR_POSITION                 0x00000000
#define _U1ADMD_ADMADDR_MASK                     0x000000FF
#define _U1ADMD_ADMADDR_LENGTH                   0x00000008

#define _U1ADMD_ADMMASK_POSITION                 0x00000008
#define _U1ADMD_ADMMASK_MASK                     0x0000FF00
#define _U1ADMD_ADMMASK_LENGTH                   0x00000008

#define _U1ADMD_ADMADDR0_POSITION                0x00000000
#define _U1ADMD_ADMADDR0_MASK                    0x00000001
#define _U1ADMD_ADMADDR0_LENGTH                  0x00000001

#define _U1ADMD_ADMADDR1_POSITION                0x00000001
#define _U1ADMD_ADMADDR1_MASK                    0x00000002
#define _U1ADMD_ADMADDR1_LENGTH                  0x00000001

#define _U1ADMD_ADMADDR2_POSITION                0x00000002
#define _U1ADMD_ADMADDR2_MASK                    0x00000004
#define _U1ADMD_ADMADDR2_LENGTH                  0x00000001

#define _U1ADMD_ADMADDR3_POSITION                0x00000003
#define _U1ADMD_ADMADDR3_MASK                    0x00000008
#define _U1ADMD_ADMADDR3_LENGTH                  0x00000001

#define _U1ADMD_ADMADDR4_POSITION                0x00000004
#define _U1ADMD_ADMADDR4_MASK                    0x00000010
#define _U1ADMD_ADMADDR4_LENGTH                  0x00000001

#define _U1ADMD_ADMADDR5_POSITION                0x00000005
#define _U1ADMD_ADMADDR5_MASK                    0x00000020
#define _U1ADMD_ADMADDR5_LENGTH                  0x00000001

#define _U1ADMD_ADMADDR6_POSITION                0x00000006
#define _U1ADMD_ADMADDR6_MASK                    0x00000040
#define _U1ADMD_ADMADDR6_LENGTH                  0x00000001

#define _U1ADMD_ADMADDR7_POSITION                0x00000007
#define _U1ADMD_ADMADDR7_MASK                    0x00000080
#define _U1ADMD_ADMADDR7_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK0_POSITION                0x00000008
#define _U1ADMD_ADMMASK0_MASK                    0x00000100
#define _U1ADMD_ADMMASK0_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK1_POSITION                0x00000009
#define _U1ADMD_ADMMASK1_MASK                    0x00000200
#define _U1ADMD_ADMMASK1_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK2_POSITION                0x0000000A
#define _U1ADMD_ADMMASK2_MASK                    0x00000400
#define _U1ADMD_ADMMASK2_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK3_POSITION                0x0000000B
#define _U1ADMD_ADMMASK3_MASK                    0x00000800
#define _U1ADMD_ADMMASK3_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK4_POSITION                0x0000000C
#define _U1ADMD_ADMMASK4_MASK                    0x00001000
#define _U1ADMD_ADMMASK4_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK5_POSITION                0x0000000D
#define _U1ADMD_ADMMASK5_MASK                    0x00002000
#define _U1ADMD_ADMMASK5_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK6_POSITION                0x0000000E
#define _U1ADMD_ADMMASK6_MASK                    0x00004000
#define _U1ADMD_ADMMASK6_LENGTH                  0x00000001

